"""Завдання 3 (Перевірити чи належить точка, яка задається своїми трьома координатами, внутрішній області сфери)"""

x = float(input("Введіть координати точки (x) "))
y = float(input("Введіть координати точки (y) "))
z = float(input("Введіть координати точки (z) "))
r0 = float(input("Введіть радіус сфери "))
x0 = float(input("Введіть координати середини сфери (x0) "))
y0 = float(input("Введіть координати середини сфери (y0) "))
z0 = float(input("Введіть координати середини сфери (z0) "))
r2 = (x-x0)**2+(y-y0)**2+(z-z0)**2
r = r2**(1/2)
print("радиус ", r)
if r<r0:
    print("Точка належить внутрішній області сфери")
elif r==r0:
    print("Точка лежить на сфері")
else:
    print("Точка не належить внутрішній області сфери")